[]
=aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa

[MACROEDIT]
//編程主選單=
lb_GameDirectory_OME->Caption=Select Game
GameManagement=File
GameManagement_Select=Select
GameManagement_New=New folder
GameManagement_Modify=Edit folder
GameManagement_Delete=Delete folder
FileManagement=Import In/Out
FileManagement_New=New
FileManagement_Open=Open
FileManagement_Save=Save
FileManagement_SaveAs=Save as
FileManagement_Delete=Delete
FileManagement_ReName=Rename
FileManagement_Transfer=Up/Download
lb_FileName_OME->Caption=File
//編程程式區=
rb_Loop_OME->Caption=LOOP
rb_Keyboard_OME->Caption=KEY
rb_If_OME->Caption=IF
rb_Equal_OME->Caption=EQU
lb_SRSectionReteatText1_OME->Caption=Start
lb_SRSectionReteatText2_OME->Caption=~
lb_SRSectionReteatText3_OME->Caption=End,
lb_SRSectionReteatText4_OME->Caption=Repeat times
lb_SR_OME->Caption=~
lb_GotoText_OME->Caption=Jump to line
lb_LineText_OME->Caption=
lb_KeyIfText_OME->Caption=If 
lb_KeyStateIsText_OME->Caption=is
lb_KeyThenGotoText_OME->Caption=Jump to line
lb_KeyLineText_OME->Caption=
lb_IfText1_OME->Caption=If
lb_IfThenGoto1_OME->Caption=Jump to line
lb_IfLineText1_OME->Caption=
lb_IfText2_OME->Caption=If
lb_IfThenGoto2_OME->Caption=Jump to line
lb_IfLineText2_OME->Caption=
cb_Key_OME->Items->Strings[0]=Key1
cb_Key_OME->Items->Strings[1]=Key2
cb_Key_OME->Items->Strings[2]=Key3
cb_Key_OME->Items->Strings[3]=Key4
cb_Key_OME->Items->Strings[4]=Key5
cb_Key_OME->Items->Strings[5]=Key6
cb_Key_OME->Items->Strings[6]=Key7
cb_Key_OME->Items->Strings[7]=Key8
cb_Key_OME->Items->Strings[8]=Key9
cb_Key_OME->Items->Strings[9]=Key10
cb_Key_OME->Items->Strings[10]=Key11
cb_Key_OME->Items->Strings[11]=Key12
cb_Key_OME->Items->Strings[12]=Key13
cb_Key_OME->Items->Strings[13]=Key14
cb_Key_OME->Items->Strings[14]=Key15
cb_Key_OME->Items->Strings[15]=Key16
cb_Key_OME->Items->Strings[16]=Key17
cb_Key_OME->Items->Strings[17]=Key18
cb_Key_OME->Items->Strings[18]=Key19
cb_Key_OME->Items->Strings[19]=Key20
cb_Key_OME->Items->Strings[20]=Key21
cb_Key_OME->Items->Strings[21]=Key22
cb_Key_OME->Items->Strings[22]=Key23
cb_Key_OME->Items->Strings[23]=Key24
cb_KeyState_OME->Items->Strings[0]=Press
cb_KeyState_OME->Items->Strings[1]=Release
cb_IfSign1_OME->Items->Strings[0]="@equ@@equ@"
cb_IfSign1_OME->Items->Strings[1]="!@equ@"
cb_IfSign2_OME->Items->Strings[0]="@equ@@equ@"
cb_IfSign2_OME->Items->Strings[1]="!@equ@"
Var->Items->Strings[0]=Variable A
Var->Items->Strings[1]=Variable B
Var->Items->Strings[2]=Variable C
Var->Items->Strings[3]=Variable D
//時間控制區=
lb_KeyDownAutoDelay_OME->Caption=Insert delay when  press
lb_KeyUpAutoDelay_OME->Caption=Insert delay when  release
lb_TimeUnit_OME->Caption=Time Unit
cb_TimeType_OME->Items->Strings[0]=Sec
cb_TimeType_OME->Items->Strings[1]=ms
cb_TimeType_OME->Items->Strings[2]=Min
lb_Time_OME->Caption=Time
//滑鼠控制區=
lb_AbsPos_OME->Caption=Mouse absolute coordinate(X,Y)
lb_AbsPos_OME->Hint=Move radar target to any point on your screen to capture the (X,Y) coordinate.
lb_RelativePos_OME->Caption=Mouse relative coordinate(X,Y)
bt_WheelUp_OME->Caption=Forward
bt_WheelDown_OME->Caption=Backward
bt_MouseLeftKey_OME->Caption=Left
bt_MouseRightKey_OME->Caption=Right
bt_MouseMidKey_OME->Caption=Middle
bt_Mouse4thKey_OME->Caption=4th
bt_Mouse5thKey_OME->Caption=5th
im_CursorPoint_OME->Hint=Move radar target to any point on your screen to capture the (X,Y) coordinate.
//編程工具列=
rb_RepeatType_OME->Hint=Non-repeat  
rb_RepeatType1_OME->Hint=Press:Start@RETURN@Release:Stop
rb_RepeatType2_OME->Hint=Press:Start @RETURN@Re-press:Stop
bt_Save_OME->Hint=Save
bt_Undo_OME->Hint=Undo
bt_Redo_OME->Hint=Redo
bt_Cut_OME->Hint=Cut
bt_Copy_OME->Hint=Copy
bt_Paste_OME->Hint=Paste
bt_MoveDown_OME->Hint=Move down
bt_MoveUp_OME->Hint=Move up
bt_Delete_OME->Hint=Delete
bt_Record_OME->Hint=Record
//編程Popup視窗=
mi_Cut_OME->Caption=Cut
mi_CutSingleLine_OME->Caption=Line Cut
mi_CutMultiLine_OME->Caption=Multi-line Cut
mi_Copy_OME->Caption=Copy
mi_CopySingleLine_OME->Caption=Line Copy
mi_CopyMultiLine_OME->Caption=Multi-line Copy
mi_Paste_OME->Caption=Paste
mi_MoveDown_OME->Caption=Move down
mi_MoveUp_OME->Caption=Move up
mi_Editline_OME->Caption=Edit this Line
mi_Delete_OME->Caption=Delete
mi_DeleteSingleLine_OME->Caption=Line Delete
mi_DeleteMultiLine_OME->Caption=Multi-line Delete
mi_ClearAllDelay_OME->Caption=Clear all "Delay"
mi_ClearAll_OME->Caption=Clear all
bt_ResumeMacroII_OME->Caption=Go to [Oscar II]
bt_DownloadExplain_OME->Caption=Manual
GoWhile=Repeat from line%x to the line, repeat %y times
IfYes=If Variable %x @equ@ %y jump to line%z
IfNo=If Variable %x ≠ %y jump to line%z
IfYes2=If Variable %x @equ@  Variable %y jump to line%z
IfNo2=If Variable %x ≠ Variable %y jump to line%z
Equ=Variable %x @equ@ %y
Equ2=Variable %x @equ@ Variable %y
Equ3_0=Variable %x @equ@ Variable %y + %z
Equ3_1=Variable %x @equ@ Variable %y - %z
Equ3_2=Variable %x @equ@ Variable %y & %z
Equ3_3=Variable %x @equ@ Variable %y | %z
Equ3_4=Variable %x @equ@ Variable %y ^ %z
Goto=Jump to line%x
IfKeyDown=If key %x is pressed,jump to line%y
IfKeyUp=If key %x is not pressed,jump to line%y
Key=Key
KeyDown=Press
KeyUp=Release
MouseMoveTo=Mouse_move_to
MouseRelativeMove=Mouse_relative_move
Delay=Delay
millisecond=ms
second=Sec
minute=Min
MouseWhellUp=Scroll_up
MouseWhellDown=Scroll_down
MouseLeftKeyDown=Press_left_key
MouseLeftKeyUp=Release_left_key
MouseLeftKeyClick=Click_left_key
MouseLeftKeyDblClick=Double_click_left_key
MouseMiddleKeyDown=Press_middle_key
MouseMiddleKeyUp=Release_middle_key
MouseMiddleKeyClick=Click_middle_key
MouseRightKeyDown=Press_right_key
MouseRightKeyUp=Release_right_key
MouseRightKeyClick=Click_right_key
MouseFourthKeyDown=Press_4th_key
MouseFourthKeyUp=Release_4th_key
MouseFourthKeyClick=Click_4th_key
MouseFifthKeyDown=Press_5th_key
MouseFifthKeyUp=Release_5th_key
MouseFifthKeyClick=Click_5th_key
PleaseInputMacroName=Input name
SaveOK=Saved!
MacroUsed=File / Folder has been applied to Mouse memory, whether you want to delete / rename? If  [Yes] the function will delete!
GoWhileRangeError=The range is invalid
InputDigitError=Please input numbers!
VersionMessage=Read version, file can not be saved!
LoopLimit=Loop can't exceed 3 circles.
NullMacro=Untitled 
PleaseCreateDirectory=Please create game folder!
DirectoryUsed=File / directory has been applied to all the core mouse memory, do you want to delete / rename it? If “YES” is elected,  the feature will be removed!
TrialAccessDeny=Thanks for viewing [HEADSHOT]! Can not apply! Please purchase Ultra-Core3 activation code online!@RETURN@(Bloody7 software is for Bloody mouse V or R series only!)
IsCoverSameNameFile=Same [Oscar II] file name found, overwrite?

CPIRemarkDefault=Default
//按鍵測試區=
lb_MouseKeyTest_OME->Caption=Key queries
PleasePressKey=Press mouse button please
MouseKeyUnknown=Unrecognized

[MACROEDIT_Record]
bt_Start->Caption=<F11> to start 
bt_Stop->Caption=<F12> to stop 
cb_AxisAbsolute->Caption=Record mouse absolute movement
cb_AxisRelatively->Caption=Record mouse relative movement
cb_KeyboardAction->Caption=Record keyboard operation
cb_MouseClick->Caption=Record mouse clicking
Script3=//Your recorded Macro as below.
Script4=//3-ways to create the Macro.
Script5=//1. Insert functions from edit panels.
Script6=//2. Input by keyboard.
Script7=//3. Input by Recorder.

[MACROEDIT_Statement]
lb_Title->Caption=Must input, before saving!
lb_Software->Caption=Applicable softwares (ex CS)
lb_Statement->Caption=Describe
lb_Comment->Caption=Function Description 
mi_EditerCut->Caption=Cut       Ctrl+X
mi_EditerCopy->Caption=Copy      Ctrl+C
mi_EditerPaste->Caption=Paste     Ctrl+P
lb_EditComment->Caption1=Fill note
lb_EditComment->Caption2=Edit note
lb_Resolution->Caption=Resolution
lb_CPIRemark->Caption=Sensitivity

[MACROEDIT_Instructions]
lb_TestDescription->Caption=Data will be stored in the mouse 4th key’s memory temporarily. While in the test zone or in the game test, to resume default 4th key setting, please go to “Key page” and reset it again
ck_CursorRecord->Caption=Initiate cursor recording
lb_InterruptTips->Caption=In case the test program out of control, press [Caps Lock]+[Scroll Lock]+[Num Lock] to interrupt it, then debug the program again.
lb_TestCommon->Caption=Describe
PressSpaceToTest=Press 4th key to start testing

[MACROEDIT_ShowIfMessage]
MacroExistAlready=File exist, replace?
MacroModify=The file has been modified. Save?
MacroNewCreate=New file?
MacroDeleteFile=Delete file permanently?
MacroSelectFile=File / Folder has been applied to Mouse memory, whether you want to delete / rename? If  [Yes] the function will delete!
MacroDeleteDirectory=Delete this game folder? Files contains in the directory will be deleted as well.
PleaseCreateDirectory=New Game
InputNameExists=File already exist. Update!
MustCreatFile=You must create a new macro file to edit!
InputNameInvalid=Invalid character detected[eg., \ / : * ? " < > | ].

[MACROEDIT_InputBoxX]
lb_NewFileName->Caption=Input name
lb_ReName->Caption1=Rename
lb_ReName->Caption2=New file
lb_ReName->Caption3=New folder
NewCreateGameName=New folder
NewCreateFileName=New file

[MACROEDIT_Dialog]
lb_Directory->Caption=Game
lb_FileName->Caption=File
lb_Title->Caption1=New
lb_Title->Caption2=Open
lb_Title->Caption3=Save
lb_Title->Caption4=Save as
lb_Title->Caption5=Delete
lb_Title->Caption6=Rename
lb_FileType->Caption=Type
advcb_FileType->Caption1=All Macro file *.*
advcb_FileType->Caption2=*.amc (Macro)
advcb_FileType->Caption3=*.mgn (Macro gun)
NoAuthorityUse=Insufficient authority, export failed!

[MACROEDIT_SelectLine]
lb_SelectLineRange->Caption=Select Line-range

